In [1]:
import pandas as pd
import re
import math
import numpy as np

## Preprocessing

In [2]:
shanghaiDataset = "https://raw.githubusercontent.com/DNQT/Foundation-of-Computer-Science-Project/main/Reference%20Databases/shanghaiData.csv"
timesDataset = "https://raw.githubusercontent.com/DNQT/Foundation-of-Computer-Science-Project/main/Reference%20Databases/timesData.csv"
worldDataset="https://raw.githubusercontent.com/DNQT/Foundation-of-Computer-Science-Project/main/Reference%20Databases/cwurData.csv"
school_and_country_Dataset="https://raw.githubusercontent.com/DNQT/Foundation-of-Computer-Science-Project/main/Reference%20Databases/school_and_country_table.csv"

In [3]:
def readDataSet(url , sep =',' , encoding='utf8',header='infer'):
    return pd.read_csv(url,sep=sep ,header=header,encoding=encoding)

In [4]:
# read datasets
shanghai_df=readDataSet(shanghaiDataset)
times_df=readDataSet(timesDataset)
world_df=readDataSet(worldDataset)
school_and_country_df=readDataSet(school_and_country_Dataset)

In [5]:
#drop the none row from shanghai datframe

index =shanghai_df[shanghai_df['university_name'].isnull()==True]
shanghai_df.drop(index.index,inplace = True)
shanghai_df.reset_index(drop=True, inplace=True)

In [6]:
# rename institution column in university_name

world_df.rename(columns={'institution':'university_name'},inplace=True)

In [7]:
shanghai_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4896 entries, 0 to 4895
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   world_rank       4896 non-null   object
 1   university_name  4896 non-null   object
 2   national_rank    4896 non-null   object
 3   total_score      1101 non-null   float64
 4   alumni           4896 non-null   float64
 5   award            4895 non-null   float64
 6   hici             4895 non-null   float64
 7   ns               4875 non-null   float64
 8   pub              4895 non-null   float64
 9   pcp              4895 non-null   float64
 10  year             4896 non-null   int64
dtypes: float64(7), int64(1), object(3)
memory usage: 420.9+ KB

In [8]:
times_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2603 non-null   object
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2603 non-null   object
 8   total_score             2603 non-null   object
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2370 non-null   object
 13  year                    2603 non-null   int64
dtypes: float64(4), int64(1), object(9)
memory usage: 284.8+ KB

In [9]:
world_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            2200 non-null   int64
 1   university_name       2200 non-null   object
 2   country               2200 non-null   object
 3   national_rank         2200 non-null   int64
 4   quality_of_education  2200 non-null   int64
 5   alumni_employment     2200 non-null   int64
 6   quality_of_faculty    2200 non-null   int64
 7   publications          2200 non-null   int64
 8   influence             2200 non-null   int64
 9   citations             2200 non-null   int64
 10  broad_impact          2000 non-null   float64
 11  patents               2200 non-null   int64
 12  score                 2200 non-null   float64
 13  year                  2200 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 240.8+ KB

## 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

In [10]:
def extract_dataset_min_max(university_name, year, index ):
    '''
    find most recent or least recent of data
    
    @university_name  : column university name 
    @year : column year
    @index : max or min
    
    '''
    dataset = pd.DataFrame()
    if(index == 'max'):
          dataset = times_df.iloc[times_df.groupby(university_name)[year].idxmax()]
            
    else: dataset = times_df.iloc[times_df.groupby(university_name)[year].idxmin()]
    return dataset

In [11]:
times_most_recent_data = extract_dataset_min_max('university_name','year','max')

In [12]:
times_least_recent_data = extract_dataset_min_max('university_name','year','min')

In [13]:
times_most_recent_data.to_csv("times_most_recent_data")
times_least_recent_data.to_csv("times_least_recent_data")

In [14]:
times_most_recent_data[['world_rank','university_name','year']].head(10)

     world_rank                           university_name  year
2405    601-800  AGH University of Science and Technology  2016
2003    201-250                        Aalborg University  2016
2056    251-300                          Aalto University  2016
1908       =106                         Aarhus University  2016
2105    301-350                    Aberystwyth University  2016
2404    601-800                Adam Mickiewicz University  2016
2057    251-300                  Aix-Marseille University  2016
2406    601-800                           Ajou University  2016
2408    601-800                     Alexandria University  2016
2409    601-800            Alexandru Ioan Cuza University  2016

In [15]:
times_least_recent_data[['world_rank','university_name','year']].head(10)

     world_rank                           university_name  year
2405    601-800  AGH University of Science and Technology  2016
501     301-350                        Aalborg University  2012
502     301-350                          Aalto University  2012
166         167                         Aarhus University  2011
476     276-300                    Aberystwyth University  2012
2404    601-800                Adam Mickiewicz University  2016
2057    251-300                  Aix-Marseille University  2016
2406    601-800                           Ajou University  2016
146         147                     Alexandria University  2011
2409    601-800            Alexandru Ioan Cuza University  2016


## 2. For each university, compute the improvement in income between the least recent and the most recent data points

nota : la colona "income" contiene valori "-" , percui prosego prima alla pulizia e poi lo converto in float

In [16]:
def clean_column_income(dataset):
    dataset=dataset[dataset.income.str.contains('-') ==False][['university_name','income','year']].copy()
    dataset.income=dataset.income.astype(float)
    return dataset

In [17]:
times_least_recent_data_clean = clean_column_income(times_least_recent_data)

In [18]:
times_most_recent_data_clean= clean_column_income(times_most_recent_data)

Unisco i due dataset tramite la colona "university_name"

In [19]:
union_most_and_least_data =pd.merge(times_least_recent_data_clean,times_most_recent_data_clean,on='university_name')

rinomino le colone

In [20]:
union_most_and_least_data.rename(columns={'income_x':'income_level_least_recent','year_x':'year_least_recent','income_y':'income_level_most_recent','year_y':'year_most_recent'},inplace=True)
union_most_and_least_data

,university_name,income_level_least_recent,year_least_recent,income_level_most_recent,year_most_recent
0,Aalborg University,36.4,2012,43.7,2016
1,Aalto University,61.9,2012,61.6,2016
2,Aarhus University,61.5,2011,68.3,2016
3,Aberystwyth University,35.5,2012,31.3,2016
4,Adam Mickiewicz University,28.7,2016,28.7,2016
...,...,...,...,...,...
699,Zhejiang University,70.3,2011,96.2,2016
700,École Normale Supérieure,30.7,2011,37.1,2016
701,École Normale Supérieure de Lyon,26.1,2011,31.7,2016
702,École Polytechnique Fédérale de Lausanne,38.0,2011,65.4,2016
703,Örebro University,29.8,2016,29.8,2016

##### nota : alcuni universita hanno come "year_most_recent" e "year_most_recent" uguale percui non ha senso tenerli

In [21]:
union_most_and_least_data[union_most_and_least_data['year_least_recent']==union_most_and_least_data['year_most_recent']].head(100)

,university_name,income_level_least_recent,year_least_recent,income_level_most_recent,year_most_recent
4,Adam Mickiewicz University,28.7,2016,28.7,2016
5,Aix-Marseille University,33.1,2016,33.1,2016
6,Ajou University,45.7,2016,45.7,2016
8,Alexandru Ioan Cuza University,28.2,2016,28.2,2016
9,Aligarh Muslim University,29.6,2016,29.6,2016
...,...,...,...,...,...
179,Khon Kaen University,35.7,2016,35.7,2016
181,King Fahd University of Petroleum and Minerals,81.2,2016,81.2,2016
184,Kingston University,28.5,2016,28.5,2016
186,Kinki University,33.2,2016,33.2,2016
188,Konkuk University,36.0,2016,36.0,2016

elimino queste colone

In [22]:
union_most_and_least_data.drop(union_most_and_least_data[union_most_and_least_data['year_least_recent']==union_most_and_least_data['year_most_recent']].index,inplace=True)

calcolo la diferenza

In [23]:
union_most_and_least_data["diference_income"] = union_most_and_least_data.income_level_most_recent - union_most_and_least_data.income_level_least_recent

creo una colona "improvement" che mi indica UP o Down in base se la income è positiva o negativa

In [24]:
union_most_and_least_data["improvement"] = np.where(union_most_and_least_data["diference_income"] > 0, "UP", "Down")

In [25]:
union_most_and_least_data.head(5)

,university_name,income_level_least_recent,year_least_recent,income_level_most_recent,year_most_recent,diference_income,improvement
0,Aalborg University,36.4,2012,43.7,2016,7.3,UP
1,Aalto University,61.9,2012,61.6,2016,-0.3,Down
2,Aarhus University,61.5,2011,68.3,2016,6.8,UP
3,Aberystwyth University,35.5,2012,31.3,2016,-4.2,Down
7,Alexandria University,36.0,2011,29.7,2016,-6.3,Down

## 3. Find the university with the largest increase computed in the previous point

In [26]:
 union_most_and_least_data[union_most_and_least_data.diference_income ==union_most_and_least_data.diference_income.max()]

,university_name,income_level_least_recent,year_least_recent,income_level_most_recent,year_most_recent,diference_income,improvement
373,TU Dresden,31.9,2012,99.7,2016,67.8,UP

## 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

#### preprocessing

nota: dataset shanghai_df , times_df ha alcuni valori espressi in range

In [27]:
shanghai_df[shanghai_df['world_rank'].str.contains('-')==True]['world_rank'].head(3)

100    101-152
101    101-152
102    101-152
Name: world_rank, dtype: object

nota : time_df porta con se alcuni valri con segno '=' davanti, che significa valore uguale, percui se lo tolgo non perde significato

In [28]:
times_df[times_df['world_rank'].str.contains('=')==True]['world_rank'].head(3)

1841    =39
1842    =39
1846    =44
Name: world_rank, dtype: object

In [29]:
times_df['world_rank']=times_df['world_rank'].str.replace('=','')

nota: world_df sembra ok , non ha valori in range e valori strani

In [30]:
world_df['world_rank'].dtype

dtype('int64')

 ### Dati più recenti per le tabelle 'shanghai_ranking', 'times_ranking' e 'world_ranking

Shanghai

In [31]:
shanghai_most_recent_data = shanghai_df.iloc[shanghai_df.groupby('university_name')['year'].idxmax()].copy()

In [32]:
shanghai_most_recent_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 658 entries, 4696 to 4545
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   world_rank       658 non-null    object
 1   university_name  658 non-null    object
 2   national_rank    658 non-null    object
 3   total_score      112 non-null    float64
 4   alumni           658 non-null    float64
 5   award            658 non-null    float64
 6   hici             658 non-null    float64
 7   ns               655 non-null    float64
 8   pub              658 non-null    float64
 9   pcp              658 non-null    float64
 10  year             658 non-null    int64
dtypes: float64(7), int64(1), object(3)
memory usage: 61.7+ KB

Times

In [33]:
times_most_recent_data = times_df.iloc[times_df.groupby('university_name')['year'].idxmax()].copy()

In [34]:
times_most_recent_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 2405 to 2134
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              818 non-null    object
 1   university_name         818 non-null    object
 2   country                 818 non-null    object
 3   teaching                818 non-null    float64
 4   international           818 non-null    object
 5   research                818 non-null    float64
 6   citations               818 non-null    float64
 7   income                  818 non-null    object
 8   total_score             818 non-null    object
 9   num_students            796 non-null    object
 10  student_staff_ratio     796 non-null    float64
 11  international_students  793 non-null    object
 12  female_male_ratio       742 non-null    object
 13  year                    818 non-null    int64
dtypes: float64(4), int64(1), object(9)
memory usage: 95.9+ KB

World

In [35]:
world_most_recent_data = world_df.iloc[world_df.groupby('university_name')['year'].idxmax()].copy()

In [36]:
world_most_recent_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1024 entries, 1981 to 1838
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            1024 non-null   int64
 1   university_name       1024 non-null   object
 2   country               1024 non-null   object
 3   national_rank         1024 non-null   int64
 4   quality_of_education  1024 non-null   int64
 5   alumni_employment     1024 non-null   int64
 6   quality_of_faculty    1024 non-null   int64
 7   publications          1024 non-null   int64
 8   influence             1024 non-null   int64
 9   citations             1024 non-null   int64
 10  broad_impact          1023 non-null   float64
 11  patents               1024 non-null   int64
 12  score                 1024 non-null   float64
 13  year                  1024 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 120.0+ KB

### nota : Bisogna vedere se le universita hanno stesso nome in queste tabele, per questo facio un controllo

In [37]:
union_world_times =pd.merge(world_most_recent_data[['world_rank','university_name']],times_most_recent_data[['world_rank','university_name']] ,on='university_name')
union_world_times

     world_rank_x                           university_name world_rank_y
0             782  AGH University of Science and Technology      601-800
1             565                        Aalborg University      201-250
2             421                          Aalto University      251-300
3             122                         Aarhus University          106
4             814                    Aberystwyth University      301-350
..            ...                                       ...          ...
584           337                           York University      301-350
585           979                        Yuan Ze University      601-800
586           191                       Zhejiang University      251-300
587            36                       École Polytechnique          101
588           639                         Örebro University      301-350

[589 rows x 3 columns]

In [38]:
def findDiff(value1,value2):
    '''
        input1 : single or range value  , string
        input2 : single or range value, string
        
        return  the max difference between input1 and input2
        if input is a range take the max difference from other input
    
    '''
    
    pattern = re.compile("(\d+)\-(\d+)")
    value1isRange= False
    value2isRange= False
    
    #controllo se è numero, range , None
    try:
        if (value1 == None and value2 == None) :
            return 0
        if (value1 == None and value2 != None):
            return value2
        if (value2 == None and value1 != None):
            return value1
        
        
        if(pattern.search(value1)):
             value1min, value1max = value1.split('-')
             value1min = int(value1min)
             value1max = int(value1max)
             value1isRange=True
             
        else:
             value1= int(value1)
             
             
        if(pattern.search(value2)):
             value2min, value2max = value2.split('-')
             value2min = int(value2min)
             value2max = int(value2max)
             value2isRange=True
            
                
        else:
            value2 =int(value2)
            
        
        if(value1isRange == False and value2isRange == False):
            return abs(value1 - value2)
        if(value1isRange == True and value2isRange == False):
                if(value2 > value1max):
                    return abs(value2 - value1min)
                if( value2 < value1min):
                    return abs(value2 - value1max)
        if(value1isRange == False and value2isRange == True):
                 if(value1 > value2max):
                     return abs(value1 - value2min)
                 if( value1 < value2min):
                    return abs(value1 - value2max)
        if(value1isRange == True and value2isRange == True):
            valoremassimo = 0
            valoreminimo = 0
            if (value1max >value2max):
                valoremassimo = value1max
            else:
                valoremassimo = value2max
            if (value1min < value2min):
                valoreminimo = value1min
            else:
                valoreminimo = value2min
            return valoremassimo - valoreminimo
    except NameError:
            print(NameError)

In [39]:
def updatedict(inputdict,key,value):
    if key in inputdict :
        if inputdict[key] < value :
            inputdict[key]= value
    else:
        inputdict[key]=value

In [40]:
mydict = {}

In [41]:
def searchUniversityAndFindDiff(dataset1, dataset2, dataset3):
    
    for university, world_rank in zip(dataset1.loc[:,'university_name'], dataset1.loc[:,'world_rank']):
        if world_rank == None:
            continue
        if((dataset2.university_name == university).any()):
            result =findDiff(str(world_rank),str(dataset2[dataset2.university_name == university].world_rank.any()))
            if result == None:
                continue
            updatedict(mydict,university, result)
        if((dataset3.university_name == university).any()):
            result=findDiff(str(world_rank),str(dataset3[dataset3.university_name == university].world_rank.any()))
            if result == None:
                continue
            updatedict(mydict,university,result)

In [42]:
searchUniversityAndFindDiff(world_most_recent_data, times_most_recent_data, shanghai_most_recent_data)

In [43]:
mydict

{'Aalborg University': 364,
 'Aalto University': 170,
 'Aarhus University': 49,
 'Aberystwyth University': 513,
 'Aix-Marseille University': 104,
 'Ajou University': 367,
 'Alexandria University': 396,
 'American University of Beirut': 181,
 'Amirkabir University of Technology': 457,
 'Aristotle University of Thessaloniki': 341,
 'Arizona State University': 92,
 'Aston University': 319,
 'Australian National University': 127,
 'Autonomous University of Barcelona': 95,
 'Bangor University': 267,
 'Bar-Ilan University': 120,
 'Beihang University': 404,
 'Beijing Normal University': 195,
 'Ben-Gurion University of the Negev': 251,
 'Bielefeld University': 213,
 'Bilkent University': 491,
 'Birkbeck, University of London': 497,
 'Blaise Pascal University': 268,
 'Boston College': 174,
 'Boston University': 7,
 'Boğaziçi University': 336,
 'Brandeis University': 89,
 'Brigham Young University': 102,
 'Brown University': 32,
 'Budapest University of Technology and Economics': 218,
 'California Institute of Technology': 11,
 'Cardiff University': 50,
 'Carlos III University of Madrid': 326,
 'Carnegie Mellon University': 39,
 'Case Western Reserve University': 28,
 'Catholic University of Korea': 110,
 'Catholic University of the Sacred Heart': 113,
 'Central South University': 137,
 'Chalmers University of Technology': 201,
 'Chang Gung University': 237,
 'Charles Darwin University': 691,
 'Charles University in Prague': 230,
 'Chiang Mai University': 217,
 'Chiba University': 382,
 'China Agricultural University': 326,
 'China University of Geosciences (Wuhan)': 303,
 'Chinese University of Hong Kong': 82,
 'Chonbuk National University': 378,
 'Chonnam National University': 416,
 'Chulalongkorn University': 489,
 'Chung Yuan Christian University': 274,
 'Chung-Ang University': 255,
 'City University London': 144,
 'City University of Hong Kong': 172,
 'Claude Bernard University Lyon 1': 293,
 'Clemson University': 317,
 'Colorado School of Mines': 114,
 'Columbia University': 9,
 'Complutense University of Madrid': 272,
 'Cornell University': 8,
 'Cranfield University': 192,
 'Creighton University': 207,
 'Curtin University': 394,
 'Czech Technical University in Prague': 215,
 'Dalhousie University': 85,
 'Dalian University of Technology': 495,
 'Dartmouth College': 256,
 'Deakin University': 278,
 'Delft University of Technology': 190,
 'Drexel University': 142,
 'Dublin City University': 442,
 'Duke University': 8,
 'Durham University': 191,
 'Eindhoven University of Technology': 172,
 'Emory University': 66,
 'Erasmus University Rotterdam': 14,
 'Ewha Womans University': 110,
 'Eötvös Loránd University': 342,
 'Federal University of Bahia': 391,
 'Federal University of Minas Gerais': 274,
 'Federal University of Rio Grande do Sul': 217,
 'Federal University of Rio de Janeiro': 278,
 'Federal University of Santa Catarina': 317,
 'Federal University of São Carlos': 340,
 'Federico Santa María Technical University': 559,
 'Feng Chia University': 382,
 'Flinders University': 369,
 'Florida Institute of Technology': 222,
 'Florida International University': 204,
 'Florida State University': 51,
 'Free University of Berlin': 75,
 'Fu Jen Catholic University': 370,
 'Fudan University': 55,
 'George Mason University': 263,
 'Georgetown University': 287,
 'Georgia Institute of Technology': 70,
 'Georgia State University': 108,
 'Ghent University': 48,
 'Goethe University Frankfurt': 74,
 'Graz University of Technology': 318,
 'Griffith University': 362,
 'Gunma University': 207,
 'Hannover Medical School': 108,
 'Hanyang University': 208,
 'Harbin Institute of Technology': 209,
 'Harvard University': 5,
 'Hebrew University of Jerusalem': 155,
 'Heriot-Watt University': 306,
 'Hiroshima University': 310,
 'Hokkaido University': 322,
 'Hong Kong Baptist University': 298,
 'Hong Kong Polytechnic University': 153,
 'Hong Kong University of Science and Technology': 260,
 'Howard University': 318,
 'Huazhong University of Science and Technology': 200,
 'Humboldt University of Berlin': 104,
 'Hunan University': 247,
 'I-Shou University': 393,
 'Illinois Institute of Technology': 179,
 'Imperial College London': 27,
 'Indian Institute of Science': 197,
 'Indian Institute of Technology Bombay': 245,
 'Indian Institute of Technology Delhi': 159,
 'Indian Institute of Technology Kanpur': 213,
 'Indian Institute of Technology Kharagpur': 213,
 'Indian Institute of Technology Madras': 133,
 'Indian Institute of Technology Roorkee': 137,
 'Inha University': 222,
 'International School for Advanced Studies': 173,
 'Iowa State University': 113,
 'Iran University of Science and Technology': 592,
 'Isfahan University of Technology': 413,
 'Istanbul Technical University': 241,
 'Jadavpur University': 422,
 'Jagiellonian University': 349,
 'James Cook University': 290,
 'Jilin University': 409,
 'Johannes Kepler University of Linz': 314,
 'Johns Hopkins University': 5,
 'Joseph Fourier University': 62,
 'Juntendo University': 335,
 'Justus Liebig University Giessen': 107,
 'Kagoshima University': 217,
 'Kanazawa University': 143,
 'Kansas State University': 247,
 'Karlsruhe Institute of Technology': 75,
 'Karolinska Institute': 43,
 'Keele University': 273,
 'Keio University': 566,
 'King Abdulaziz University': 844,
 'King Abdullah University of Science and Technology': 403,
 'King Fahd University of Petroleum and Minerals': 346,
 "King's College London": 39,
 'Kobe University': 480,
 'Korea Advanced Institute of Science and Technology (KAIST)': 4,
 'Korea University': 185,
 'Kumamoto University': 381,
 'Kyoto University': 71,
 'Kyungpook National University': 493,
 'Kyushu University': 400,
 'La Trobe University': 294,
 'Lancaster University': 296,
 'Lanzhou University': 213,
 'Lehigh University': 236,
 'Leiden University': 41,
 'Linköping University': 104,
 'Liverpool John Moores University': 195,
 'Lomonosov Moscow State University': 102,
 'London School of Hygiene & Tropical Medicine': 154,
 'Loughborough University': 343,
 'Louisiana State University - Baton Rouge': 131,
 'Lund University': 27,
 'Maastricht University': 137,
 'Macquarie University': 248,
 'Makerere University': 468,
 'Manchester Metropolitan University': 384,
 'Marche Polytechnic University': 261,
 'Masaryk University': 201,
 'Massachusetts Institute of Technology': 2,
 'Massey University': 257,
 'McGill University': 22,
 'McMaster University': 56,
 'Medical College of Wisconsin': 203,
 'Medical University of Graz': 173,
 'Medical University of South Carolina': 197,
 'Medical University of Vienna': 64,
 'Memorial University of Newfoundland': 210,
 'Miami University': 356,
 'Michigan State University': 19,
 'Michigan Technological University': 440,
 'Middle East Technical University': 130,
 'Mines ParisTech': 146,
 'Mississippi State University': 205,
 'Missouri University of Science and Technology': 217,
 'Monash University': 72,
 'Montana State University - Bozeman': 155,
 'Moscow Institute of Physics and Technology': 550,
 'Murdoch University': 428,
 'Nagasaki University': 314,
 'Nagoya University': 225,
 'Nanjing Medical University': 485,
 'Nanjing University': 56,
 'Nanyang Technological University': 80,
 'Nara Institute of Science and Technology': 146,
 'National Autonomous University of Mexico': 166,
 'National Cheng Kung University': 274,
 'National Chiao Tung University': 85,
 'National Chung Cheng University': 264,
 'National Chung Hsing University': 256,
 'National Taipei University of Technology': 396,
 'National Taiwan Normal University': 431,
 'National Taiwan Ocean University': 345,
 'National Taiwan University': 143,
 'National Technical University of Athens': 194,
 'National Tsing Hua University': 206,
 'National University of Córdoba': 332,
 'National University of Ireland, Galway': 307,
 'National University of Ireland, Maynooth': 502,
 'National University of Singapore': 85,
 'National Yang-Ming University': 141,
 'National and Kapodistrian University of Athens': 199,
 'New Jersey Institute of Technology': 360,
 'New York University': 12,
 'Newcastle University': 16,
 'Niigata University': 332,
 'North Carolina State University': 68,
 'Northeastern University': 74,
 'Northern Arizona University': 365,
 'Northwestern Polytechnical University': 347,
 'Northwestern University': 5,
 'Norwegian University of Science and Technology': 157,
 'Novosibirsk State University': 584,
 'Oakland University': 305,
 'Ocean University of China': 245,
 'Ohio University': 340,
 'Okayama University': 555,
 'Old Dominion University': 305,
 'Osaka City University': 126,
 'Osaka Prefecture University': 202,
 'Osaka University': 255,
 'Panjab University': 109,
 'Peking University': 94,
 'Plymouth University': 286,
 'Pohang University of Science and Technology': 235,
 'Polytechnic University of Catalonia': 130,
 'Polytechnic University of Milan': 196,
 'Polytechnic University of Turin': 302,
 'Polytechnic University of Valencia': 360,
 'Pompeu Fabra University': 211,
 'Pontifical Catholic University of Chile': 124,
 'Portland State University': 260,
 'Princeton University': 3,
 'Pusan National University': 148,
 'Queen Mary University of London': 111,
 'Queensland University of Technology': 370,
 'RMIT University': 472,
 'RWTH Aachen University': 120,
 'Radboud University Nijmegen': 9,
 'Renmin University of China': 104,
 'Rice University': 36,
 'Rockefeller University': 4,
 'Royal College of Surgeons in Ireland': 460,
 'Royal Holloway, University of London': 411,
 'Royal Institute of Technology': 174,
 'Rush University': 177,
 'Saarland University': 138,
 'Saint Louis University': 136,
 'Saitama University': 308,
 'Sapienza University of Rome': 138,
 'Scuola Normale Superiore di Pisa': 281,
 'Sejong University': 267,
 'Semmelweis University': 116,
 'Seoul National University': 126,
 'Shandong University': 112,
 'Shanghai Jiao Tong University': 170,
 'Sharif University of Technology': 296,
 'Shinshu University': 271,
 'Sichuan University': 321,
 'Simon Fraser University': 161,
 'Sogang University': 219,
 'South China University of Technology': 161,
 'Southeast University': 142,
 'Southern Methodist University': 359,
 'Stanford University': 1,
 'Stockholm University': 91,
 'Stony Brook University': 162,
 'Sun Yat-sen University': 126,
 'Swansea University': 378,
 'Swedish University of Agricultural Sciences': 215,
 'Swinburne University of Technology': 387,
 'Syracuse University': 212,
 'Taipei Medical University': 206,
 'Tampere University of Technology': 176,
 'Technical University of Berlin': 119,
 'Technical University of Denmark': 73,
 'Technical University of Dortmund': 186,
 'Technical University of Madrid': 365,
 'Technical University of Munich': 48,
 'Tehran University of Medical Sciences': 353,
 'Tel Aviv University': 164,
 'Thomas Jefferson University': 146,
 'Tianjin University': 269,
 'Tilburg University': 488,
 'Tohoku University': 177,
 'Tokyo Institute of Technology': 141,
 'Tokyo Medical and Dental University': 108,
 'Tokyo Metropolitan University': 100,
 'Tokyo University of Agriculture and Technology': 223,
 'Tokyo University of Science': 319,
 'Tongji University': 180,
 'Tsinghua University': 72,
 'Tufts University': 55,
 'United Arab Emirates University': 449,
 'University College Cork': 85,
 'University College Dublin': 162,
 'University College London': 13,
 'University of A Coruña': 398,
 'University of Aberdeen': 113,
 'University of Adelaide': 186,
 'University of Alabama at Birmingham': 154,
 'University of Alaska Fairbanks': 290,
 'University of Alberta': 30,
 'University of Alcalá': 248,
 'University of Amsterdam': 56,
 'University of Antwerp': 122,
 'University of Arizona': 95,
 'University of Auckland': 94,
 'University of Aveiro': 156,
 'University of Barcelona': 84,
 'University of Bari Aldo Moro': 123,
 'University of Basel': 73,
 'University of Bath': 154,
 'University of Bayreuth': 119,
 'University of Bergen': 101,
 'University of Bern': 80,
 'University of Birmingham': 51,
 'University of Bonn': 64,
 'University of Bradford': 420,
 'University of Brasília': 319,
 'University of Bremen': 234,
 'University of Brescia': 102,
 'University of Brighton': 223,
 'University of Bristol': 57,
 'University of British Columbia': 28,
 'University of Bucharest': 385,
 'University of Buenos Aires': 216,
 'University of Burgundy': 153,
 'University of Cagliari': 169,
 'University of Calcutta': 490,
 'University of Calgary': 83,
 'University of California, Berkeley': 6,
 'University of California, Davis': 9,
 'University of California, Irvine': 39,
 'University of California, Los Angeles': 3,
 'University of California, Riverside': 113,
 'University of California, San Diego': 18,
 'University of California, San Francisco': 8,
 'University of California, Santa Barbara': 26,
 'University of California, Santa Cruz': 61,
 'University of Cambridge': 1,
 'University of Campinas': 103,
 'University of Canterbury': 132,
 'University of Cape Town': 128,
 'University of Central Lancashire': 337,
 'University of Chemistry and Technology, Prague': 379,
 'University of Chicago': 2,
 'University of Chile': 175,
 'University of Cincinnati': 193,
 'University of Coimbra': 106,
 'University of Cologne': 41,
 'University of Colorado Boulder': 73,
 'University of Connecticut': 182,
 'University of Copenhagen': 39,
 'University of Crete': 164,
 'University of Cyprus': 577,
 'University of Delhi': 421,
 'University of Duisburg-Essen': 112,
 'University of Dundee': 57,
 'University of East Anglia': 187,
 'University of Edinburgh': 31,
 'University of Erlangen-Nuremberg': 81,
 'University of Essex': 331,
 'University of Exeter': 240,
 'University of Ferrara': 131,
 'University of Florence': 153,
 'University of Florida': 60,
 'University of Fribourg': 372,
 'University of Geneva': 39,
 'University of Genoa': 170,
 'University of Georgia': 102,
 'University of Glasgow': 52,
 'University of Gothenburg': 86,
 'University of Granada': 169,
 'University of Graz': 183,
 'University of Greifswald': 484,
 'University of Groningen': 36,
 'University of Göttingen': 78,
 'University of Haifa': 299,
 'University of Hamburg': 88,
 'University of Hawaii at Manoa': 337,
 'University of Helsinki': 44,
 'University of Hertfordshire': 202,
 'University of Hohenheim': 492,
 'University of Hong Kong': 126,
 'University of Houston': 216,
 'University of Hull': 105,
 'University of Iceland': 210,
 'University of Idaho': 254,
 'University of Ioannina': 181,
 'University of Iowa': 109,
 'University of Jena': 172,
 'University of Jyväskylä': 320,
 'University of Kansas': 154,
 'University of Kent': 391,
 'University of Kentucky': 83,
 'University of Konstanz': 315,
 'University of La Laguna': 102,
 'University of Lausanne': 114,
 'University of Leeds': 60,
 'University of Leicester': 73,
 'University of Limerick': 480,
 'University of Lisbon': 343,
 'University of Liverpool': 98,
 'University of Liège': 70,
 'University of Ljubljana': 296,
 'University of Lorraine': 184,
 'University of Louisville': 203,
 'University of Malaya': 197,
 'University of Manchester': 11,
 'University of Manitoba': 178,
 'University of Mannheim': 796,
 'University of Marburg': 145,
 'University of Maribor': 319,
 'University of Maryland, Baltimore': 125,
 'University of Maryland, College Park': 45,
 'University of Massachusetts Amherst': 118,
 'University of Melbourne': 60,
 'University of Miami': 63,
 'University of Milan': 178,
 'University of Milan - Bicocca': 118,
 'University of Minho': 128,
 'University of Minnesota, Twin Cities': 18,
 'University of Modena and Reggio Emilia': 81,
 'University of Montana - Missoula': 284,
 'University of Montreal': 50,
 'University of Münster': 80,
 'University of Nantes': 138,
 'University of Naples Federico II': 132,
 'University of Neuchâtel': 357,
 'University of New Mexico': 219,
 'University of New South Wales': 48,
 'University of Newcastle': 243,
 'University of Nice Sophia Antipolis': 104,
 'University of North Carolina at Chapel Hill': 23,
 'University of North Carolina at Greensboro': 396,
 'University of Notre Dame': 223,
 'University of Nottingham': 3,
 'University of Oslo': 41,
 'University of Otago': 156,
 'University of Ottawa': 107,
 'University of Oulu': 146,
 'University of Oxford': 5,
 'University of Padua': 181,
 'University of Palermo': 127,
 'University of Pennsylvania': 3,
 'University of Perugia': 156,
 'University of Pisa': 205,
 'University of Porto': 192,
 'University of Portsmouth': 196,
 'University of Pretoria': 275,
 'University of Pécs': 291,
 'University of Reading': 99,
 'University of Regensburg': 182,
 'University of Regina': 335,
 'University of Rennes 1': 125,
 'University of Rhode Island': 205,
 'University of Rochester': 77,
 'University of Salamanca': 136,
 'University of Salento': 364,
 'University of Santiago de Compostela': 237,
 'University of Science and Technology Beijing': 270,
 'University of Seoul': 259,
 'University of Seville': 202,
 'University of Sheffield': 76,
 'University of Sherbrooke': 101,
 'University of South Australia': 400,
 'University of Southampton': 38,
 'University of Southern California': 17,
 'University of Southern Denmark': 155,
 'University of Southern Mississippi': 300,
 'University of St Andrews': 223,
 'University of Stirling': 433,
 'University of Strasbourg': 168,
 'University of Stuttgart': 115,
 'University of Surrey': 274,
 'University of Sussex': 113,
 'University of Sydney': 62,
 'University of São Paulo': 168,
 'University of Tartu': 186,
 'University of Tasmania': 272,
 'University of Technology, Sydney': 514,
 'University of Tennessee, Knoxville': 73,
 'University of Texas at Arlington': 125,
 'University of Texas at Austin': 16,
 'University of Texas at Dallas': 111,
 'University of Texas at El Paso': 328,
 'University of Texas at San Antonio': 109,
 'University of Tokyo': 30,
 'University of Toronto': 13,
 'University of Trento': 363,
 'University of Tsukuba': 238,
 'University of Turin': 129,
 'University of Turku': 82,
 'University of Twente': 259,
 'University of Tübingen': 78,
 'University of Ulm': 122,
 'University of Utah': 112,
 'University of Valencia': 206,
 'University of Vermont': 76,
 'University of Victoria': 151,
 'University of Vienna': 81,
 'University of Virginia': 109,
 'University of Waikato': 536,
 'University of Warsaw': 161,
 'University of Warwick': 213,
 'University of Waterloo': 90,
 'University of Western Australia': 107,
 'University of Wollongong': 266,
 'University of Wyoming': 165,
 'University of York': 194,
 'University of Zagreb': 150,
 'University of Zaragoza': 116,
 'University of Zurich': 42,
 'University of the Basque Country': 115,
 'University of the Witwatersrand': 151,
 'Uppsala University': 63,
 'Utah State University': 165,
 'Utrecht University': 31,
 'VU University Amsterdam': 31,
 'Vanderbilt University': 18,
 'Victoria University of Wellington': 237,
 'Vienna University of Technology': 176,
 'Virginia Commonwealth University': 108,
 'Vrije Universiteit Brussel': 70,
 'Wake Forest University': 341,
 'Waseda University': 762,
 'Washington University in St. Louis': 20,
 'Wayne State University': 211,
 'Weizmann Institute of Science': 111,
 'Western University (The University of Western Ontario)': 167,
 'Wuhan University of Technology': 326,
 'Xiamen University': 187,
 'Xidian University': 390,
 'Yale University': 1,
 'Yamaguchi University': 256,
 'Yeshiva University': 129,
 'Yokohama City University': 287,
 'Yokohama National University': 282,
 'Yonsei University': 252,
 'Yuan Ze University': 378,
 'Zhejiang University': 109,
 'École Polytechnique': 65,
 'Örebro University': 338}